/**
 * Created by jige on 2016/12/1.
 */
// 使用 Mock
var Mock = require('mockjs');

//交易机会
Mock.mock(/.*?\/trade_list/, 'post', function(options){
    const dataString = [
        "2016-12-30 天津金融资产登记结算有限公司25%股权 787.500 金融服务 天津市 天津产权交易中心 刘松", 
        "2016-12-30 天津诚惠达物业服务有限公司100%股权 496.880 服务业 天津市 天津产权交易中心 刘松",
        "2016-12-30 山东良达铁合金有限责任公司33.31%国有股权及21615.25万元债权 21615.350 黑色金属 泰安市 山东产权交易中心 王女士",
        "2016-12-30 河北银行股份有限公司1.35%股权转让公告 21599.286 金融服务 石家庄市 河北金融资产交易所 胡女士",
        "2016-12-30 山东新申纺织有限责任公司49%国有股权及11577.18万元债权 15452.510 制造业 泰安市 山东产权交易中心 王女士",
        "2016-12-30 山东中选机械设备有限公司30%国有股权及6151.15万元债权 7008.150 机械设备 泰安市 山东产权交易中心 王女士",
        "2016-12-30 泰安恒祥煤业有限公司100%国有产权及4327.89万元债权 4494.890 商业贸易 泰安市 山东产权交易中心 王女士",
        "2016-12-29 内江市浩鹏投资有限公司100%股权 12000.000 服务业 内江市 天津产权交易中心 刘松",
        "2016-12-29 天津海泰优点创业投资企业17.3137%股权 5651.370 服务业 天津市 天津产权交易中心 孔凡政",
        "2016-12-27 汕头市侨丰集团有限公司29.13%股权 3419.650 食品饮料 汕头市 南方联合产权交易中心 陈楚鹏",
        "2016-12-27 天津海泰优点创业投资企业26.0111%股权 8490.291 服务业 天津市 天津产权交易中心 刘松",
        "2016-12-23 天津力神电池股份有限公司3.4%股权(4250万股) 32172.500 工业 天津市 天津产权交易中心 刘松",
        "2016-12-23 江西省招标咨询集团有限公司增资项目 31600.000 信息服务 南昌市 江西省产权交易所 万先生",
        "2016-12-22 银联商务有限公司1.20%股权 21600.000 信息服务 上海市 上海联合产权交易所 汤颖莹(股权二部)、胡继雯",
        "2016-12-22 国电宿州热电有限公司15%股权 3238.050 公用事业 宿州市 上海联合产权交易所 徐艳、沈徐凯",
        "2016-12-22 国电宿州热电有限公司60%股权 12952.200 公用事业 宿州市 上海联合产权交易所 徐艳、沈徐凯",
        "2016-12-22 上海科创太平洋酒店有限公司100%股权 658.000 餐饮旅游 上海市 上海联合产权交易所 陈文军(央企六部)、沈徐凯",
        "2016-12-22 上海天圆药品包装材料厂100%产权 979.000 工业 上海市 上海联合产权交易所 汤颖莹(股权二部)、万雅宁",
        "2016-12-22 上海欧华投资管理有限公司100%股权 11875.000 信息服务 上海市 上海联合产权交易所 陈文军(央企六部)、沈徐凯",
        "2016-12-22 上海实久公司100%产权 9058.175 商业贸易 上海市 上海联合产权交易所 陆渊杰(股权一部)、胡继雯",
        "2016-12-21 上海无委无线电检测实验室有限公司100%股权 480.000 服务业 上海市 上海联合产权交易所 陆渊杰(股权一部)、万雅宁",
        "2016-12-21 广元市利州区农村信用合作联社0.13277%股权 80.270 金融服务 广元市 西南联合产权交易所 邓洪君",
        "2016-12-20 上海普瑞信钢板制造有限公司33.33%股权 3060.704 机械设备 上海市 上海联合产权交易所 汤颖莹、胡继雯",
        "2016-12-20 上海国际田径黄金大奖赛有限公司100%股权 500.000 服务业 上海市 上海联合产权交易所 陆渊杰(股权一部)、项仁庆",
        "2016-12-13 前海股权交易中心(深圳)有限公司8.4933%股权 20500.000 金融服务 深圳市 上海联合产权交易所 董慧聪、沈徐凯",
        "2016-12-06 山东影视制作股份有限公司增资扩股 60000.000 服务业 济南市 山东产权交易中心 王女士",
        "2016-11-30 中轻海鸥洗涤用品有限公司75%股份 3821.300 化工 徐州市 北京产权交易所 綦佳茵、刘雪",
        "2016-09-29 中轻海鸥洗涤用品有限公司75%股份 4022.420 化工 徐州市 北京产权交易所 綦佳茵、刘雪",
        "2016-09-23 深圳市雅视科技有限公司100%股权转让公告(第四次) 12000.000 制造业 深圳市 深圳联合产权交易所 段小姐、叶先生",
        "2016-09-06 大庆市华拓数码科技有限公司7.5251%股权(500万元股权) 4452.260 信息服务 大庆市 深圳联合产权交易所"];
    let dataArr = [];
    const pageNumber = JSON.parse(options.body).pageNumber
    for(let i=0; i<10;i++){
        const index = (pageNumber-1)*10 +i;
        dataArr.push({
            marked:dataString[index].split(" ")[1],
            money:dataString[index].split(" ")[2],
            address:dataString[index].split(" ")[4],
            source:dataString[index].split(" ")[5],
            contact:dataString[index].split(" ")[6],
            date:dataString[index].split(" ")[0],
            industry:dataString[index].split(" ")[3]
        })
    }
    return	{
        bodyData:dataArr,
        lastPage: pageNumber==3
    }
});

//并购动态
Mock.mock(/.*?\/dynamic_list/, 'post', function(options){
    let dataArr = [];
    for(let i=0; i<10;i++){
        dataArr.push({id:parseInt(Math.random()*1000),date:'2017-11-11',title:'重庆百货转让两家公司股权',industry:'金融'})
    }
    return	{
        bodyData:dataArr,
        lastPage:false
    }
});
//并购动态_详细
Mock.mock(/.*?\/dynamic_detail/, 'post', function(options){
    return	{
        bodyData:{
            detail:'该公司和一家美国公司合并了。该公司和一家美国公司合并了。该公司和一家美国公司合并了。该公司和一家美国公司合并了。该公司和一家美国公司合并了。该公司和一家美国公司合并了。该公司和一家美国公司合并了。该公司和一家美国公司合并了。该公司和一家美国公司合并了。该公司和一家美国公司合并了。',
            timeLine:[{date:'2017-01-11',text:'该公司和一家美国公司合并了'},{date:'2017-01-11',text:'该公司和一家美国公司合并了'}],
            process:'完成',
            money:parseInt(Math.random()*1000000),
            stock:parseInt(Math.random()*100),
            title:'国公司合并了。该公司和一家美国公司合并了。该公司和一家美国公司合并了。该公司和一家美国公',
        }
    }
});

//行业列表
Mock.mock(/.*?\/industry_list/, 'get', function(options){
    return	{
        bodyData:['军工','服务','信息']
    }
});

//区域列表
Mock.mock(/.*?\/address_list/, 'get', function(options){
    return	{
        bodyData:['天津','北京','上海']
    }
});

//并购事件
Mock.mock(/.*?\/events_data/, 'post', function(options){
    const data = [
        {"name":"北京","id":"234234","value":23},{"name":"辽宁省","id":"2324","value":82},
        {"name":"天津","id":"234234","value":23},{"name":"吉林省","id":"234234","value":73},
        {"name":"甘肃省","id":"234234","value":43},{"name":"黑龙江省","id":"234234","value":72},
        {"name":"河北省","id":"234234","value":45},{"name":"上海","id":"234234","value":54},
        {"name":"山西省","id":"234234","value":23},{"name":"江苏省","id":"234234","value":34},
        {"name":"内蒙古自治区","id":"234234","value":43},{"name":"安徽省","id":"234234","value":52},
        {"name":"其他","id":"234234","value":92}
    ];
    return	{
        bodyData:{
            data:data
        }
    }
});

//并购事件排名
Mock.mock(/.*?\/events_order/, 'post', function(options){
    return	{
        bodyData:{
            industry:['黑色金属','制造业','服务业','公共事业','信息服务','工业'],
            data:[273,345,466,524,653,823],
        }
    }
});
//并购事件列表
Mock.mock(/.*?\/events_list/, 'post', function(options){
    let dataArr = [];
    for(let i=0; i<2;i++){
        dataArr.push({id:parseInt(Math.random()*1000),date:'2017-11-11',title:'重庆百货转让两家公司股权',industry:'金融'})
    }
    return	{
        bodyData:dataArr
    }
});

//并购事件详情
Mock.mock(/.*?\/events_detail/, 'post', function(options){
    return	{
        bodyData:{
            buy:{
                name:'6名自然人法人',
                type:'6名自然人法人',
                stock1:'15',
                stock2:'34',
                industry:'军工'
            },
            sell:{
                name:'6名自然人法人',
                type:'6名自然人法人',
                stock1:'15',
                stock2:'34',
                industry:'军工'
            },
            target:{
                name:'6名自然人法人',
                type:'6名自然人法人',
                stock1:'15',
                stock2:'34',
                industry:'军工'
            },
            detail:{
                money:'232',
                pay:'3234523',
                target:'434',
                stock:'33',
                merge:'并购方式',
                type:'标的类型',
                goal:'bud',
                access:'shi'
            },
            process:['签署签署转让协议签署转让协议签署转让协议转让协议','签署转让协议']

        }
    }
});